#  Copyright (c) 2023. IPCRC, Lab. Jiangnig Wei
#  All rights reserved

"""
@Project: 2023-GCN-action-recognize-tutorial
@FileName: pingpong_class_labels.py
@Description: 自动描述，请及时修改
@Author: Wei Jiangning
@version: 1.0.0a1.0
@Date: 2023/9/22 17:09 at PyCharm
"""

pp_labels = {
    0: "转不转-不转",
    1: "转不转-下旋",
    2: "逆旋转-上旋",
    3: "逆旋转-下旋",
    4: "顺侧旋-上旋",
    5: "顺侧旋-下旋",
    6: "勾手-上旋",
    7: "勾手-下旋",
    8: "反手-上旋",
    9: "反手-下旋",
    10: "正手动作-攻",
    11: "正手动作-拉上旋",
    12: "正手动作-拉下旋",
    13: "正手动作-带",
    14: "正手动作-挑",
    15: "正手动作-摆短",
    16: "正手动作-劈长",
    17: "正手动作-推",
    18: "正手动作-防",
    19: "反手动作-拨",
    20: "反手动作-弹",
    21: "反手动作-撕",
    22: "反手动作-拉上旋",
    23: "反手动作-拉下旋",
    24: "反手动作-拧",
    25: "反手动作-挑",
    26: "反手动作-摆短",
    27: "反手动作-劈长",
    28: "反手动作-防"
}

pp_star_challenge = {
    0: "反手-拧",
    1: "反手-撕",
    2: "正手-快带",
    3: "正手-搓",
    4: "发球-顺侧旋",
    5: "反手-拨",
    6: "反手-弹",
    7: "反手-搓",
    8: "正手-被动",
    9: "正手-拉",
    10: "发球-勾手",
    11: "正手-挑",
    12: "反手-拉",
    13: "反手-被动"
}